# SelectedType

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**kind** | **str** |  | [optional] [readonly]

## Example

```python
from ideastatica_connection_api.models.selected_type import SelectedType

# TODO update the JSON string below
json = "{}"
# create an instance of SelectedType from a JSON string
selected_type_instance = SelectedType.from_json(json)
# print the JSON string representation of the object
print(selected_type_instance.to_json())

# convert the object into a dict
selected_type_dict = selected_type_instance.to_dict()
# create an instance of SelectedType from a dict
selected_type_from_dict = SelectedType.from_dict(selected_type_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)